{
  "backend/main.mo": "Motoko actor that stores and serves music theory educational content including chord progressions, scales, theory explanations, improvisation tips, and composition suggestions via query functions.",
  "feature_evidence.json": "Feature evidence report documenting three completed features related to PitchDisplay component fixes, deployment error resolution, and successful Internet Computer deployment.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, utilities, and pages for the music theory application with audio analysis and visualization features.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx module script into the root div.",
  "frontend/src/App.tsx": "Root React component that configures ThemeProvider, QueryClient, and renders MusicTheoryApp with toast notifications.",
  "frontend/src/components/AudioAnalyzer.tsx": "Component implementing Web Audio API pitch detection with 40-second rolling window, confidence-based key detection (80% threshold), device selection, and three-state analysis flow (listening/analyzing/locked).",
  "frontend/src/components/CircleOfFifths.tsx": "SVG-based interactive circle of fifths visualization with smooth transitions, highlighting active keys and neighbors, and pulsing animations for the selected key.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and attribution link to caffeine.ai with heart icon.",
  "frontend/src/components/Header.tsx": "Sticky header with music icon, gradient title, and subtitle describing the application as a real-time audio analysis and music theory education tool.",
  "frontend/src/components/KeySelector.tsx": "Manual key selection interface with note and mode dropdowns, reset functionality, and visual indicators for auto-detected (locked with success styling) and analyzing keys.",
  "frontend/src/components/MicrophonePermissionPrompt.tsx": "React component that displays a UI prompt for requesting microphone permission or instructions for enabling it if denied, with browser-specific guidance for Chrome, Firefox, and Safari.",
  "frontend/src/components/PitchDisplay.tsx": "React component that displays real-time pitch tracking information including detected note, frequency in Hz, signal strength progress bar, and whether the note is in the active musical key.",
  "frontend/src/components/TheoryPanel.tsx": "React component that displays music theory information (chord progressions, scales, or improvisation tips) for a selected key, fetching data via custom hooks and showing loading skeletons during data fetch.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and context provider for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useMicrophonePermission.ts": "Custom React hook that manages microphone permission state using the Permissions API and localStorage fallback, providing methods to check and request microphone access.",
  "frontend/src/hooks/useQueries.ts": "Collection of custom React Query hooks that fetch music theory data (keys, chord progressions, scales, theory topics, improvisation tips, composition suggestions) from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color system for light and dark modes, defining theme variables for primary (purple), accent (teal), success, warning, destructive colors, and utility classes.",
  "frontend/src/lib/musicTheory.ts": "Music theory utility functions for converting frequencies to note indices, detecting musical keys from pitch arrays, validating notes against keys, and generating scale notes for different modes (Ionian, Dorian, etc.).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, rendering the main App component.",
  "frontend/src/pages/MusicTheoryApp.tsx": "Main music theory application page managing audio listening state, key detection (auto and manual), pitch/note display, microphone permissions, and rendering UI components including CircleOfFifths, AudioAnalyzer, KeySelector, TheoryPanel, and PitchDisplay. (Content truncated in source)",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color tokens, container settings, border radius variables, animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document indicating an audio pitch detection app with known layout shift issues in note/frequency display fields, listing six existing features focused on fixing PitchDisplay component to use fixed-height placeholders and resolving deployment errors."
}